In [31]:
import pandas as pd 
import matplotlib.pyplot as plt 
import sklearn.linear_model as lm 
import math

In [106]:
df=pd.read_csv('hiring.csv')

In [114]:
df.head()

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        one                    8.0                           9      50000
1        one                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000

In [115]:
a= lambda x:x+5
a(7)

12

In [116]:
df['salaryy']=df['salary($)'].apply(a)

In [125]:
df.head(3)

,experience,test_score(out of 10),interview_score(out of 10),salary($),salaryy,exp,exp1
0,one,8.0,9,50000,50005,True,o
1,one,8.0,6,45000,45005,True,o
2,five,6.0,7,60000,60005,False,f

In [123]:
df['exp']=df.experience.apply(lambda x:x.startswith('o'))

In [124]:
df['exp1']=df.experience.str[0]

In [132]:
x=format()
x

'5'

In [109]:
from word2number import w2n

In [113]:
df.experience.apply(w2n.word_to_num)

0     1
1     1
2     5
3     2
4     7
5     3
6    10
7    11
Name: experience, dtype: int64

In [35]:
type(df.experience[2])

str

In [108]:
df.experience= df.experience.fillna('one')

In [37]:
import string

In [89]:
df.experience.head()

0      one
1      one
2     five
3      two
4    seven
Name: experience, dtype: object

In [39]:
#df.experience= df.experience.to_string(index=False)

In [45]:
num_try = w2n.word_to_num(df.experience[0])
num_try

1

In [46]:
def wtonum(x):
    return w2n.word_to_num(x)

In [90]:
df.experience=df.experience.apply(lambda x: wtonum(x))

In [91]:
df.experience.head()

0    1
1    1
2    5
3    2
4    7
Name: experience, dtype: int64

In [92]:
df.isna().sum()

experience                    0
test_score(out of 10)         1
interview_score(out of 10)    0
salary($)                     0
dtype: int64

In [93]:
na_replacement= df['test_score(out of 10)'].median()
na_replacement

8.0

In [94]:
df['test_score(out of 10)']=df['test_score(out of 10)'].fillna(na_replacement)

In [95]:
df.isna().sum()

experience                    0
test_score(out of 10)         0
interview_score(out of 10)    0
salary($)                     0
dtype: int64

In [96]:
reg= lm.LinearRegression()
reg

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [97]:
reg.fit(df[['experience','test_score(out of 10)','interview_score(out of 10)']],df['salary($)'])

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [99]:
reg.predict([[1,8,5]])

array([43965.38534967])

In [100]:
reg.coef_

array([3031.1979513 , 1893.22650937, 2485.73083785])

In [102]:
reg.intercept_

13359.721134159758

In [ ]:
plt.plot(df.)